'''
Дана непустая строка. вывести коды ее первого и последнего символа.
'''
a = input("Введите текст: ")
print(a)
print(f"Первый код символа {(a[0])}: {ord(a[0])} || Второй код символа {(a[-1])}: {ord(a[-1])}") #вывожу коды первого и последнего символа