'''
Туристические агентства предлагают следующие туры. Вояж — Мексика,Канада,Израиль,
Италия, США. РейнаТур — Англия, Япония,Канада, ЮАР. Радуга —- США,Испания, Швеция,
Австралия.
Определить в каких турагенствах можно приобрести туры в Канаду, а в каких в США
'''


def program():
    voyage = {'Мексика', 'Канада', 'Израиль', 'Италия', 'США'}
    reinaTour = {'Англия', 'Япония', 'Канада', 'ЮАР'}
    rainbow = {'США', 'Испания', 'Швеция', 'Австралия'}
    if 'США' in voyage or reinaTour or rainbow:





program()
